IDEA Open Model
CrossSectionFactory.FillShapeTrev Method
Compatible with IDEA StatiCa 20.1
 T turned shape - massive concrete shape
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public static void FillShapeTrev(
	CrossSectionParameter css,
	double b,
	double h,
	double hf,
	double bw
)
Public Shared Sub FillShapeTrev (
	css As CrossSectionParameter,
	b As Double,
	h As Double,
	hf As Double,
	bw As Double
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
b
Type: System.Double
Width of shape
h
Type: System.Double
Height of shape
hf
Type: System.Double
Top flange width
bw
Type: System.Double
Wall width
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace